import 'package:flutter/material.dart';
import 'package:newsapplication/models/post/post.dart';
import 'package:newsapplication/models/post/posts_manager.dart';
import 'package:newsapplication/models/title/news_title.dart';
import 'package:newsapplication/models/title/news_titles_manager.dart';
import 'package:newsapplication/shared/components/constants.dart';
import 'package:provider/provider.dart';
import '/modules/news_screen/NewsScreen.dart';
class Home extends StatefulWidget {
  const Home({Key? key}) : super(key: key);

  @override
  _HomeState createState() => _HomeState();
}

class _HomeState extends State<Home> {
  @override
  void initState() {
    Provider.of<NewsTitlesManager>(context, listen: false)
        .titlesList.add(NewsTitle(id: "1", title: "اخر الاخبار", typeTitle: TypeTitle.MIXED));
    Provider.of<NewsTitlesManager>(context, listen: false)
        .titlesList.add(NewsTitle(id: "2", title: "عاجل", typeTitle: TypeTitle.CLOUD));
    Provider.of<NewsTitlesManager>(context, listen: false)
        .titlesList.add(NewsTitle(id: "3", title: "الصرف", typeTitle: TypeTitle.CLOUD));
    Provider.of<NewsTitlesManager>(context, listen: false)
        .titlesList.add(NewsTitle(id: "4", title: "عالمية", typeTitle: TypeTitle.CLOUD));
    Provider.of<NewsTitlesManager>(context, listen: false)
        .titlesList.add(NewsTitle(id: "5", title: "المفضلات", typeTitle: TypeTitle.FAVORITE));

    Provider.of<PostsManager>(context, listen: false)
        .postsList.add(
        Post(
          id: "1",
          title:
          "I have some text, maybe long and a box, WxH fixed size. I've calculated that given my font size and height scale, I can fit L lines of text. So I put maxLines and ellipsize and it works in Android app (since line height is predictable), but doesn't in Flutter app.",
          imageTitle:
          "https://cdn.pixabay.com/photo/2015/04/23/22/00/tree-736885__480.jpg",
          detail:
          "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة Essa بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب "
              "مركز العالمية للغات والتعليم المستمر يعلن عن بدأ التسجيل في الدبلومات التالية.دبلوم القباله التوليديةدبلوم مساعد طبيب دبلوم التمريض العام دبلوم التغذية العلاجية دورة الاسعافات الاوليه مجاناً موعد_الدراسة: تبدأ الفترتين الصباحية والمسائية من السبت الموافق 2021/8/14.مميزاتنا: كادر تدريسي وتدريبي متخصص وذو كفاءات عالية - قاعات تدريسية واسعة ومجهزة بـ ٲحدث وسائل التعليم والتدريب ",
          isSync: true,
          date: "${DateTime.now()}",
          type: Provider.of<NewsTitlesManager>(context, listen: false)
              .titlesList[2],
          imageList: [],
          isRead: false,
          isFavorite: false,
        ));
    super.initState();
  }
  @override
  Widget build(BuildContext context) {

    return NewsScreen();
  }
}
